# ðŸ§  SQL Cheat Sheet for Data Science

## ðŸ“ 1. Select Basics

In [ ]:
SELECT * FROM employees;
SELECT name, salary FROM employees;
SELECT DISTINCT department FROM employees;

## ðŸ” 2. Filtering Rows

In [ ]:
SELECT * FROM employees WHERE salary > 50000;
SELECT * FROM employees WHERE department = 'HR';
SELECT * FROM employees WHERE age BETWEEN 25 AND 35;
SELECT * FROM employees WHERE name LIKE 'A%';

## ðŸ” 3. Sorting

In [ ]:
SELECT * FROM employees ORDER BY salary DESC;
SELECT * FROM employees ORDER BY department, age;

## ðŸ§¼ 4. NULL Handling

In [ ]:
SELECT * FROM employees WHERE manager_id IS NULL;
SELECT * FROM employees WHERE department IS NOT NULL;

## ðŸ§  5. Aggregation

In [ ]:
SELECT COUNT(*) FROM employees;
SELECT AVG(salary), MAX(salary) FROM employees;
SELECT department, SUM(salary) FROM employees GROUP BY department;

## ðŸ”— 6. Joins

In [ ]:
-- Inner Join
SELECT e.name, d.dept_name 
FROM employees e
JOIN departments d ON e.dept_id = d.id;

-- Left Join
SELECT e.name, d.dept_name 
FROM employees e
LEFT JOIN departments d ON e.dept_id = d.id;

## ðŸ§ª 7. Subqueries

In [ ]:
SELECT name FROM employees 
WHERE salary > (SELECT AVG(salary) FROM employees);

## ðŸ§¾ 8. Set Operations

In [ ]:
SELECT name FROM employees_2023
UNION
SELECT name FROM employees_2024;

## ðŸ•’ 9. Date Functions

In [ ]:
SELECT NOW();
SELECT EXTRACT(YEAR FROM hire_date) AS hire_year FROM employees;

## ðŸ“š 10. Aliases and CASE

In [ ]:
SELECT name AS Employee, salary * 12 AS Annual_Salary FROM employees;

SELECT name,
       CASE 
           WHEN salary > 80000 THEN 'High'
           WHEN salary > 50000 THEN 'Medium'
           ELSE 'Low'
       END AS salary_level
FROM employees;